ka2_2024/src/Documents/УстановкаЗначенийНефинансовыхПоказателей/УстановкаЗначенийНефинансовыхПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЗначенийНефинансовыхПоказателей</name>
  <comment>Установка значений</comment>
  <registerRecords>InformationRegister.ЗначенияНефинансовыхПоказателей</registerRecords>
  <attributes>
    <name>НефинансовыйПоказатель</name>
    <type>
      <types>CatalogRef.НефинансовыеПоказателиБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийУстановкиЗначенийНефинансовыхПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонВвода</name>
    <type>
      <types>CatalogRef.ШаблоныВводаНефинансовыхПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНефинансовыхПоказателей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗначенияКолонок</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DocumentRef</types>
        <types>EnumRef</types>
        <types>ChartOfCharacteristicTypesRef</types>
        <types>CatalogRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяИзмерения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтрокиДокумента</name>
    <attributes>
      <name>НомерСтрокиДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Сценарий</name>
      <type>
        <types>CatalogRef.Сценарии</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПодПериода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика1</name>
      <type>
        <types>Characteristic.АналитикиСтатейБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика2</name>
      <type>
        <types>Characteristic.АналитикиСтатейБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика3</name>
      <type>
        <types>Characteristic.АналитикиСтатейБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика4</name>
      <type>
        <types>Characteristic.АналитикиСтатейБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика5</name>
      <type>
        <types>Characteristic.АналитикиСтатейБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика6</name>
      <type>
        <types>Characteristic.АналитикиСтатейБюджетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КолонкиДокумента</name>
    <attributes>
      <name>НомерСтрокиДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Сценарий</name>
      <type>
        <types>CatalogRef.Сценарии</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПодПериода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика1</name>
      <type>
        <types>Characteristic.АналитикиСтатейБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика2</name>
      <type>
        <types>Characteristic.АналитикиСтатейБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика3</name>
      <type>
        <types>Characteristic.АналитикиСтатейБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика4</name>
      <type>
        <types>Characteristic.АналитикиСтатейБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика5</name>
      <type>
        <types>Characteristic.АналитикиСтатейБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика6</name>
      <type>
        <types>Characteristic.АналитикиСтатейБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>НефинансовыйПоказатель</name>
      <type>
        <types>CatalogRef.НефинансовыеПоказателиБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>31</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗначенияПоказателей</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.НефинансовыеПоказателиБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>31</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ka2_2024/src/Enums/ВидыОперацийУстановкиЗначенийНефинансовыхПоказателей/ВидыОперацийУстановкиЗначенийНефинансовыхПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийУстановкиЗначенийНефинансовыхПоказателей</name>
  <enumValues>
    <name>ВводЗначенияПоказателя</name>
  </enumValues>
  <enumValues>
    <name>ВводЗначенийПоШаблону</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/Documents/УстановкаЗначенийНефинансовыхПоказателей/Forms/ИсторияВводаЗначений/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Параметры.Свойство("НефинансовыйПоказатель", НефинансовыйПоказатель) Тогда
		ТекстСообщения = НСтр("ru='Непосредственное открытие этой формы не предусмотрено. Для открытия формы можно воспользоваться командой ""История изменений"" в форме нефинансового показателя.'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	Параметр = Список.Параметры.Элементы.Найти("НефинансовыйПоказатель");
	Параметр.Значение = НефинансовыйПоказатель;
	Параметр.Использование = Истина;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	ПараметрыУстановки = Новый Структура();
	ЗначенияЗаполнения = Новый Структура("НефинансовыйПоказатель, ВидОперации", НефинансовыйПоказатель,
			ПредопределенноеЗначение("Перечисление.ВидыОперацийУстановкиЗначенийНефинансовыхПоказателей.ВводЗначенияПоказателя"));
	ПараметрыУстановки.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.УстановкаЗначенийНефинансовыхПоказателей.Форма.ФормаДокумента", ПараметрыУстановки,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
